benchmarks/weirOverflow/Allrun
#!/bin/sh
cd ${0%/*} || exit 1 # run from this directory
rm log.* 2> /dev/null
rm -r 0.* [1-9]*

# Source tutorial run functions
. /opt/openfoam7/bin/tools/RunFunctions

rm 0/alpha.water
runApplication blockMesh
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
